performance/tests/approvedProducts.yml
execution:
  - concurrency: ${__P(scenario-concurrency,1)}
    hold-for: ${__P(scenario-duration,60)}
    scenario: approved-products

scenarios:
  approved-products:
    variables:
      # HC01 Comfort Health Clinic
      facility_id: e6799d64-d10d-4011-b8c2-0e4d4a3f65ce
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/facilities/${facility_id}/approvedProducts?fullSupply=true
        method: GET
        label: Get1000ApprovedFullSupplyProductsForHealthClinic
        headers:
          Authorization: Bearer ${access_token}

reporting:
    - module: passfail
      criteria:
        Get 1000 Approved Full Supply Products For Health Clinic too slow: p90 of Get1000ApprovedFullSupplyProductsForHealthClinic>2000ms