performance/tests/approvedProductsForEssentialMedsAndDistrictHospital.yml
execution:
  - concurrency: ${__P(scenario-concurrency,1)}
    hold-for: ${__P(scenario-duration,60)}
    scenario: full-supply-approved-products
  - concurrency: ${__P(scenario-concurrency,1)}
    hold-for: ${__P(scenario-duration,60)}
    scenario: non-full-supply-approved-products

scenarios:
  get-user-token:
    requests:
      - url: ${__P(base-uri)}/api/oauth/token
        method: POST
        label: GetUserToken
        headers:
          Authorization: Basic ${__base64Encode(${__P(basic-auth)})}
        body:
          grant_type: password
          username: ${__P(username)}
          password: ${__P(password)}
        extract-jsonpath:
          access_token:
            jsonpath: $.access_token
  full-supply-approved-products:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/facilities/13037147-1769-4735-90a7-b9b310d128b8/approvedProducts?fullSupply=true&programId=10845cb9-d365-4aaa-badd-b4fa39c6a26a
        method: GET
        label: GetApprovedFullSupplyProductsForDistrictHospital
        headers:
          Authorization: Bearer ${access_token}
  non-full-supply-approved-products:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/facilities/13037147-1769-4735-90a7-b9b310d128b8/approvedProducts?fullSupply=false&programId=10845cb9-d365-4aaa-badd-b4fa39c6a26a
        method: GET
        label: GetApprovedNonFullSupplyProductsForDistrictHospital
        headers:
          Authorization: Bearer ${access_token}

reporting:
    - module: passfail
      criteria:
        Get Approved Full Supply Products For District Hospital too slow: p90 of GetApprovedFullSupplyProductsForDistrictHospital>500ms
        Get Approved Non Full Supply Products For District Hospital too slow: p90 of GetApprovedNonFullSupplyProductsForDistrictHospital>500ms