performance/tests/facilityTypeApprovedProducts.yml
execution:
  - concurrency: ${__P(scenario-concurrency,1)}
    hold-for: ${__P(scenario-duration,60)}
    scenario: ftaps-get-first-10

scenarios:
  ftaps-get-first-10:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/facilityTypeApprovedProducts?page=1&size=10&facilityType=dist_hosp&program=PRG002
        method: GET
        label: GetAFacilityTypeApprovedProductsPageOfTen
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json

reporting:
    - module: passfail
      criteria:
        90% of get facility type approved products page of ten fail to get in 100ms milliseconds: p90 of GetAFacilityTypeApprovedProductsPageOfTen>100ms, continue as failed